{"32,116": 259, "104,101": 260, "32,97": 261, "105,110": 262, "259,260": 263, "101,114": 264, "111,110": 265, "32,44": 266, "114,101": 267, "32,115": 268, "101,100": 269, "32,119": 270, "32,111": 271, "110,100": 272, "97,116": 273, "32,46": 274, "111,114": 275, "101,110": 276, "32,99": 277, "105,116": 278, "32,102": 279, "105,115": 280, "101,115": 281, "97,114": 282, "32,98": 283, "97,110": 284, "271,102": 285, "32,262": 286, "97,108": 287, "262,103": 288, "32,112": 289, "97,115": 290, "261,272": 291, "259,111": 292, "105,99": 293, "114,111": 294, "32,109": 295, "32,100": 296, "32,104": 297, "105,265": 298, "108,101": 299, "111,117": 300, "32,84": 301, "32,267": 302, "32,61": 303, "32,83": 304, "105,108": 305, "32,65": 306, "276,116": 307, "32,34": 308, "32,49": 309, "259,104": 310, "115,116": 311, "101,108": 312, "32,67": 313, "32,108": 314, "32,64": 315, "111,109": 316, "32,101": 317, "32,10": 318, "97,109": 319, "32,110": 320, "97,99": 321, "97,100": 322, "270,290": 323, "32,77": 324, "32,66": 325, "101,99": 326, "32,265": 327, "301,260": 328, "108,121": 329, "117,114": 330, "32,39": 331, "101,116": 332, "105,100": 333, "111,108": 334, "32,103": 335, "105,109": 336, "32,73": 337, "45,64": 338, "315,338": 339, "279,275": 340, "105,114": 341, "105,103": 342, "105,118": 343, "111,116": 344, "116,264": 345, "32,72": 346, "117,116": 347, "261,115": 348, "117,115": 349, "111,119": 350, "278,104": 351, "97,121": 352, "32,50": 353, "32,80": 354, "268,116": 355, "32,260": 356, "118,264": 357, "273,298": 358, "270,351": 359, "283,101": 360, "32,82": 361, "310,273": 362, "32,68": 363, "99,101": 364, "117,110": 365, "101,109": 366, "32,87": 367, "270,104": 368, "32,70": 369, "283,121": 370, "99,104": 371, "116,104": 372, "261,108": 373, "32,41": 374, "32,40": 375, "32,76": 376, "117,108": 377, "32,71": 378, "32,280": 379, "277,265": 380, "264,115": 381, "261,116": 382, "99,116": 383, "32,78": 384, "114,97": 385, "111,115": 386, "309,57": 387, "261,110": 388, "32,278": 389, "260,114": 390, "294,109": 391, "97,272": 392, "117,109": 393, "32,74": 394, "281,116": 395, "48,48": 396, "32,69": 397, "297,280": 398, "97,103": 399, "97,118": 400, "97,262": 401, "114,105": 402, "111,100": 403, "279,391": 404, "32,79": 405, "280,116": 406, "277,316": 407, "32,118": 408, "289,294": 409, "111,112": 410, "305,108": 411, "111,267": 412, "105,102": 413, "108,100": 414, "117,112": 415, "32,114": 416, "264,101": 417, "101,119": 418, "267,115": 419, "342,104": 420, "337,110": 421, "105,281": 422, "296,101": 423, "98,264": 424, "282,100": 425, "282,116": 426, "275,116": 427, "268,101": 428, "270,417": 429, "293,104": 430, "273,101": 431, "97,107": 432, "287,108": 433, "284,116": 434, "111,99": 435, "117,100": 436, "97,112": 437, "317,120": 438, "113,117": 439, "265,103": 440, "97,98": 441, "277,104": 442, "271,114": 443, "32,75": 444, "103,104": 445, "101,282": 446, "281,115": 447, "273,269": 448, "289,108": 449, "268,104": 450, "278,121": 451, "105,112": 452, "343,101": 453, "319,101": 454, "32,85": 455, "297,322": 456, "326,116": 457, "321,107": 458, "304,116": 459, "268,117": 460, "290,116": 461, "115,101": 462, "103,101": 463, "267,100": 464, "32,107": 465, "368,430": 466, "300,114": 467, "109,307": 468, "32,299": 469, "117,272": 470, "261,267": 471, "111,118": 472, "105,284": 473, "105,287": 474, "320,344": 475, "312,108": 476, "268,112": 477, "111,311": 478, "32,121": 479, "420,116": 480, "105,97": 481, "275,100": 482, "117,311": 483, "282,121": 484, "262,101": 485, "116,390": 486, "112,116": 487, "114,278": 488, "32,51": 489, "300,110": 490, "112,112": 491, "293,287": 492, "400,101": 493, "313,104": 494, "32,365": 495, "353,396": 496, "99,99": 497, "286,99": 498, "102,345": 499, "300,414": 500, "32,86": 501, "283,347": 502, "341,311": 503, "280,104": 504, "300,115": 505, "102,102": 506, "116,101": 507, "298,115": 508, "115,111": 509, "407,112": 510, "353,48": 511, "333,101": 512, "117,267": 513, "32,294": 514, "270,260": 515, "117,98": 516, "261,114": 517, "380,116": 518, "105,101": 519, "111,103": 520, "32,59": 521, "342,110": 522, "279,503": 523, "277,108": 524, "119,111": 525, "356,114": 526, "117,101": 527, "114,121": 528, "389,115": 529, "290,115": 530, "263,341": 531, "275,109": 532, "111,107": 533, "275,107": 534, "286,116": 535, "302,115": 536, "346,101": 537, "32,58": 538, "273,264": 539, "373,509": 540, "261,98": 541, "265,100": 542, "316,101": 543, "261,100": 544, "300,116": 545, "114,284": 546, "109,264": 547, "105,267": 548, "260,100": 549, "114,117": 550, "32,349": 551, "399,101": 552, "100,117": 553, "32,52": 554, "336,101": 555, "289,264": 556, "108,350": 557, "112,264": 558, "368,111": 559, "32,53": 560, "301,104": 561, "327,101": 562, "297,493": 563, "268,99": 564, "112,108": 565, "287,329": 566, "350,110": 567, "105,299": 568, "302,99": 569, "309,56": 570, "116,269": 571, "46,64": 572, "315,572": 573, "259,525": 574, "278,298": 575, "117,445": 576, "105,122": 577, "267,101": 578, "276,364": 579, "330,288": 580, "116,115": 581, "112,427": 582, "360,276": 583, "289,426": 584, "306,108": 585, "283,326": 586, "293,101": 587, "297,290": 588, "261,103": 589, "261,491": 590, "511,49": 591, "300,445": 592, "44,64": 593, "315,593": 594, "32,106": 595, "32,276": 596, "296,280": 597, "108,436": 598, "107,101": 599, "271,357": 600, "268,264": 601, "310,280": 602, "275,121": 603, "312,121": 604, "479,446": 605, "358,115": 606, "366,424": 607, "267,110": 608, "383,298": 609, "300,272": 610, "321,104": 611, "285,102": 612, "261,499": 613, "32,415": 614, "114,293": 615, "108,392": 616, "321,101": 617, "449,352": 618, "296,281": 619, "337,116": 620, "282,107": 621, "111,357": 622, "284,364": 623, "271,347": 624, "263,121": 625, "295,284": 626, "322,101": 627, "259,101": 628, "321,116": 629, "271,486": 630, "105,98": 631, "109,284": 632, "377,116": 633, "32,336": 634, "32,89": 635, "112,104": 636, "419,115": 637, "498,598": 638, "276,115": 639, "99,269": 640, "330,110": 641, "119,110": 642, "270,500": 643, "262,100": 644, "259,555": 645, "265,101": 646, "289,267": 647, "535,111": 648, "118,312": 649, "405,110": 650, "455,110": 651, "119,425": 652, "278,101": 653, "119,101": 654, "270,101": 655, "297,336": 656, "111,262": 657, "273,281": 658, "32,54": 659, "268,260": 660, "108,281": 661, "317,118": 662, "320,101": 663, "305,109": 664, "382,116": 665, "290,269": 666, "278,269": 667, "441,299": 668, "101,272": 669, "290,101": 670, "105,269": 671, "319,112": 672, "275,115": 673, "407,109": 674, "97,267": 675, "286,345": 676, "294,576": 677, "111,121": 678, "386,101": 679, "265,115": 680, "101,112": 681, "490,116": 682, "284,103": 683, "102,532": 684, "373,108": 685, "111,403": 686, "295,412": 687, "99,281": 688, "270,534": 689, "32,55": 690, "334,100": 691, "97,305": 692, "97,119": 693, "264,269": 694, "288,115": 695, "306,110": 696, "118,101": 697, "305,100": 698, "320,418": 699, "268,326": 700, "283,332": 701, "515,110": 702, "262,287": 703, "279,101": 704, "279,664": 705, "293,107": 706, "304,101": 707, "307,115": 708, "105,505": 709, "119,352": 710, "273,116": 711, "102,116": 712, "97,349": 713, "280,115": 714, "102,264": 715, "32,56": 716, "324,282": 717, "103,284": 718, "267,273": 719, "402,98": 720, "380,115": 721, "306,114": 722, "294,470": 723, "432,101": 724, "302,109": 725, "118,269": 726, "259,114": 727, "296,326": 728, "290,265": 729, "284,115": 730, "296,580": 731, "275,372": 732, "32,470": 733, "516,108": 734, "32,57": 735, "104,452": 736, "589,401": 737, "306,115": 738, "295,478": 739, "335,454": 740, "344,104": 741, "263,109": 742, "387,57": 743, "327,329": 744, "273,104": 745, "289,114": 746, "105,120": 747, "654,276": 748, "317,282": 749, "111,98": 750, "334,557": 751, "310,284": 752, "294,112": 753, "268,415": 754, "358,287": 755, "102,412": 756, "384,418": 757, "541,545": 758, "117,103": 759, "409,553": 760, "277,307": 761, "345,110": 762, "465,110": 763, "302,116": 764, "101,121": 765, "442,282": 766, "268,440": 767, "277,284": 768, "300,372": 769, "701,748": 770, "314,539": 771, "275,110": 772, "302,299": 773, "733,264": 774, "293,116": 775, "310,578": 776, "116,265": 777, "104,110": 778, "114,265": 779, "277,334": 780, "261,383": 781, "105,418": 782, "32,396": 783, "287,115": 784, "32,439": 785, "397,110": 786, "310,677": 787, "275,414": 788, "111,533": 789, "320,393": 790, "268,111": 791, "295,101": 792, "261,497": 793, "302,108": 794, "368,568": 795, "32,385": 796, "317,272": 797, "376,101": 798, "547,293": 799, "306,799": 800, "299,383": 801, "279,108": 802, "345,115": 803, "435,107": 804, "289,386": 805, "114,287": 806, "460,98": 807, "101,357": 808, "377,282": 809, "348,115": 810, "273,288": 811, "515,267": 812, "32,357": 813, "296,352": 814, "302,103": 815, "99,107": 816, "700,542": 817, "276,264": 818, "97,333": 819, "361,101": 820, "283,117": 821, "313,316": 822, "280,298": 823, "295,627": 824, "319,281": 825, "343,269": 826, "260,115": 827, "289,101": 828, "569,482": 829, "115,265": 830, "423,102": 831, "98,393": 832, "279,467": 833, "335,294": 834, "279,751": 835, "428,729": 836, "783,48": 837, "317,112": 838, "340,109": 839, "268,543": 840, "460,371": 841, "261,109": 842, "111,334": 843, "280,549": 844, "295,472": 845, "360,756": 846, "105,111": 847, "259,385": 848, "304,112": 849, "295,349": 850, "263,267": 851, "270,488": 852, "260,110": 853, "293,115": 854, "394,111": 855, "477,326": 856, "105,312": 857, "309,48": 858, "105,599": 859, "403,101": 860, "268,121": 861, "605,115": 862, "628,319": 863, "306,116": 864, "117,287": 865, "561,280": 866, "333,307": 867, "32,47": 868, "314,282": 869, "373,832": 870, "304,104": 871, "286,100": 872, "294,115": 873, "305,121": 874, "350,808": 875, "32,307": 876, "551,269": 877, "110,288": 878, "277,433": 879, "284,107": 880, "268,330": 881, "413,293": 882, "261,99": 883, "330,121": 884, "297,420": 885, "289,734": 886, "360,288": 887, "838,280": 888, "401,269": 889, "263,110": 890, "108,269": 891, "116,276": 892, "97,106": 893, "296,111": 894, "649,410": 895, "314,435": 896, "438,112": 897, "413,101": 898, "114,280": 899, "309,55": 900, "737,311": 901, "286,118": 902, "32,48": 903, "283,108": 904, "289,419": 905, "450,350": 906, "344,390": 907, "790,424": 908, "306,499": 909, "766,321": 910, "428,357": 911, "544,100": 912, "277,111": 913, "268,332": 914, "262,364": 915, "106,457": 916, "101,107": 917, "282,115": 918, "586,454": 919, "302,364": 920, "325,488": 921, "713,101": 922, "469,322": 923, "556,684": 924, "262,115": 925, "320,111": 926, "638,288": 927, "268,288": 928, "273,390": 929, "287,101": 930, "262,281": 931, "105,107": 932, "105,264": 933, "546,115": 934, "279,610": 935, "651,667": 936, "97,341": 937, "270,476": 938, "302,112": 939, "295,265": 940, "304,99": 941, "289,334": 942, "309,50": 943, "283,458": 944, "283,741": 945, "277,437": 946, "387,56": 947, "601,422": 948, "309,53": 949, "111,424": 950, "114,319": 951, "313,265": 952, "350,264": 953, "450,452": 954, "366,307": 955, "278,115": 956, "117,419": 957, "105,464": 958, "299,121": 959, "264,116": 960, "367,104": 961, "112,276": 962, "304,260": 963, "105,332": 964, "343,381": 965, "295,401": 966, "387,52": 967, "295,262": 968, "622,110": 969, "100,264": 970, "296,333": 971, "118,276": 972, "335,111": 973, "97,122": 974, "277,267": 975, "334,520": 976, "312,102": 977, "634,112": 978, "423,895": 979, "295,332": 980, "278,422": 981, "786,103": 982, "314,440": 983, "343,264": 984, "284,121": 985, "280,269": 986, "264,109": 987, "116,288": 988, "284,110": 989, "117,371": 990, "284,101": 991, "97,464": 992, "317,109": 993, "341,100": 994, "855,778": 995, "295,411": 996, "102,377": 997, "108,108": 998, "261,341": 999, "295,273": 1000, "888,860": 1001, "507,272": 1002, "548,383": 1003, "268,819": 1004, "355,436": 1005, "626,121": 1006, "347,101": 1007, "283,294": 1008, "290,104": 1009, "423,112": 1010, "273,453": 1011, "277,282": 1012, "309,54": 1013, "277,500": 1014, "443,342": 1015, "270,282": 1016, "518,262": 1017, "911,287": 1018, "97,104": 1019, "313,108": 1020, "800,284": 1021, "372,592": 1022, "337,272": 1023, "296,413": 1024, "857,100": 1025, "286,311": 1026, "300,462": 1027, "289,410": 1028, "280,101": 1029, "366,98": 1030, "763,567": 1031, "387,55": 1032, "116,121": 1033, "117,566": 1034, "387,54": 1035, "306,483": 1036, "309,49": 1037, "380,99": 1038, "116,305": 1039, "105,319": 1040, "32,90": 1041, "367,282": 1042, "118,782": 1043, "378,264": 1044, "381,265": 1045, "271,98": 1046, "117,269": 1047, "268,109": 1048, "764,641": 1049, "363,101": 1050, "388,121": 1051, "360,718": 1052, "264,110": 1053, "510,299": 1054, "619,522": 1055, "619,99": 1056, "268,522": 1057, "410,299": 1058, "371,843": 1059, "873,115": 1060, "109,121": 1061, "284,99": 1062, "280,109": 1063, "111,344": 1064, "32,395": 1065, "259,934": 1066, "497,447": 1067, "409,118": 1068, "432,288": 1069, "704,273": 1070, "325,108": 1071, "333,269": 1072, "286,102": 1073, "416,365": 1074, "749,329": 1075, "517,116": 1076, "577,269": 1077, "296,406": 1078, "850,293": 1079, "271,642": 1080, "320,446": 1081, "773,666": 1082, "495,1039": 1083, "313,334": 1084, "879,269": 1085, "317,506": 1086, "336,281": 1087, "365,101": 1088, "455,83": 1089, "406,115": 1090, "536,112": 1091, "114,333": 1092, "283,312": 1093, "276,110": 1094, "289,530": 1095, "311,366": 1096, "117,464": 1097, "279,262": 1098, "324,352": 1099, "474,329": 1100, "289,104": 1101, "347,298": 1102, "296,567": 1103, "597,99": 1104, "468,115": 1105, "277,488": 1106, "386,269": 1107, "120,116": 1108, "335,818": 1109, "296,1003": 1110, "377,108": 1111, "105,393": 1112, "373,440": 1113, "286,115": 1114, "996,298": 1115, "647,118": 1116, "97,120": 1117, "921,504": 1118, "1044,632": 1119, "834,415": 1120, "612,293": 1121, "309,51": 1122, "101,98": 1123, "103,264": 1124, "279,319": 1125, "117,99": 1126, "263,462": 1127, "893,275": 1128, "295,403": 1129, "295,352": 1130, "32,36": 1131, "364,487": 1132, "306,100": 1133, "271,962": 1134, "284,463": 1135, "325,101": 1136, "295,305": 1137, "289,657": 1138, "103,103": 1139, "314,392": 1140, "268,336": 1141, "398,116": 1142, "306,759": 1143, "335,969": 1144, "707,487": 1145, "264,118": 1146, "460,1067": 1147, "1145,607": 1148, "1143,483": 1149, "332,115": 1150, "306,112": 1151, "367,788": 1152, "271,558": 1153, "459,658": 1154, "631,299": 1155, "262,107": 1156, "335,117": 1157, "277,682": 1158, "665,458": 1159, "551,101": 1160, "268,454": 1161, "121,115": 1162, "652,115": 1163, "1056,720": 1164, "828,1058": 1165, "337,115": 1166, "369,275": 1167, "321,269": 1168, "910,345": 1169, "121,112": 1170, "319,269": 1171, "586,922": 1172, "585,108": 1173, "312,115": 1174, "309,52": 1175, "314,859": 1176, "601,118": 1177, "394,117": 1178, "369,546": 1179, "103,269": 1180, "261,723": 1181, "355,426": 1182, "310,592": 1183, "32,269": 1184, "387,53": 1185, "354,108": 1186, "32,81": 1187, "465,109": 1188, "270,262": 1189, "117,281": 1190, "110,264": 1191, "380,311": 1192, "292,533": 1193, "271,497": 1194, "550,383": 1195, "400,288": 1196, "1036,806": 1197, "283,711": 1198, "405,383": 1199, "388,110": 1200, "276,101": 1201, "754,582": 1202, "472,101": 1203, "114,288": 1204, "384,472": 1205, "835,288": 1206, "268,747": 1207, "320,732": 1208, "317,299": 1209, "313,282": 1210, "387,51": 1211, "349,115": 1212, "346,875": 1213, "861,1096": 1214, "590,446": 1215, "279,703": 1216, "920,826": 1217, "524,530": 1218, "262,269": 1219, "1199,950": 1220, "343,281": 1221, "356,322": 1222, "289,391": 1223, "114,322": 1224, "721,333": 1225, "434,115": 1226, "108,288": 1227, "305,451": 1228, "363,326": 1229, "492,329": 1230, "354,294": 1231, "387,49": 1232, "317,357": 1233, "355,431": 1234, "821,698": 1235, "267,116": 1236, "317,611": 1237, "284,117": 1238, "438,116": 1239, "279,453": 1240, "544,118": 1241, "114,406": 1242, "262,97": 1243, "347,104": 1244, "294,108": 1245, "635,534": 1246, "761,884": 1247, "408,282": 1248, "283,111": 1249, "270,411": 1250, "471,97": 1251, "328,121": 1252, "273,604": 1253, "386,115": 1254, "1048,433": 1255, "103,332": 1256, "584,293": 1257, "324,101": 1258, "314,898": 1259, "384,732": 1260, "343,288": 1261, "114,305": 1262, "302,582": 1263, "32,93": 1264, "32,91": 1265, "116,299": 1266, "412,100": 1267, "325,121": 1268, "394,1088": 1269, "473,115": 1270, "482,288": 1271, "277,451": 1272, "103,262": 1273, "112,269": 1274, "295,282": 1275, "444,288": 1276, "295,1128": 1277, "655,917": 1278, "886,293": 1279, "1178,329": 1280, "32,37": 1281, "714,298": 1282, "346,282": 1283, "380,102": 1284, "283,392": 1285, "302,102": 1286, "457,298": 1287, "262,99": 1288, "109,269": 1289, "1205,607": 1290, "330,371": 1291, "302,311": 1292, "822,109": 1293, "367,411": 1294, "270,788": 1295, "295,269": 1296, "354,104": 1297, "268,915": 1298, "281,112": 1299, "928,299": 1300, "385,712": 1301, "385,636": 1302, "112,275": 1303, "1151,1262": 1304, "98,299": 1305, "296,332": 1306, "324,99": 1307, "401,115": 1308, "402,269": 1309, "108,504": 1310, "316,332": 1311, "717,371": 1312, "595,483": 1313, "397,100": 1314, "314,461": 1315, "457,269": 1316, "330,287": 1317, "46,46": 1318, "260,311": 1319, "298,287": 1320, "97,336": 1321, "313,284": 1322, "259,641": 1323, "343,604": 1324, "356,108": 1325, "305,116": 1326, "373,557": 1327, "289,111": 1328, "378,101": 1329, "489,48": 1330, "105,307": 1331, "99,108": 1332, "469,712": 1333, "273,115": 1334, "869,463": 1335, "314,485": 1336, "1024,715": 1337, "287,281": 1338, "304,769": 1339, "277,675": 1340, "268,769": 1341, "413,671": 1342, "363,580": 1343, "296,114": 1344, "274,1318": 1345, "355,114": 1346, "283,789": 1347, "813,115": 1348, "399,527": 1349, "366,487": 1350, "268,108": 1351, "268,1059": 1352, "1229,607": 1353, "310,994": 1354, "400,121": 1355, "498,267": 1356, "353,53": 1357, "940,372": 1358, "296,527": 1359, "590,294": 1360, "618,269": 1361, "294,119": 1362, "295,990": 1363, "662,307": 1364, "32,413": 1365, "294,507": 1366, "388,907": 1367, "394,1238": 1368, "387,50": 1369, "1368,484": 1370, "638,269": 1371, "368,273": 1372, "354,114": 1373, "449,617": 1374, "283,666": 1375, "450,427": 1376, "337,73": 1377, "265,121": 1378, "438,565": 1379, "1144,468": 1380, "289,1045": 1381, "98,433": 1382, "270,1366": 1383, "367,853": 1384, "727,458": 1385, "437,284": 1386, "277,672": 1387, "259,278": 1388, "283,267": 1389, "271,414": 1390, "287,102": 1391, "397,117": 1392, "320,454": 1393, "423,745": 1394, "289,427": 1395, "307,329": 1396, "317,801": 1397, "112,299": 1398, "105,579": 1399, "608,116": 1400, "394,1386": 1401, "405,114": 1402, "596,103": 1403, "270,265": 1404, "98,121": 1405, "442,698": 1406, "314,278": 1407, "465,411": 1408, "409,103": 1409, "111,322": 1410, "355,603": 1411, "512,111": 1412, "399,281": 1413, "110,101": 1414, "289,953": 1415, "301,101": 1416, "409,116": 1417, "325,294": 1418, "302,1043": 1419, "403,121": 1420, "408,280": 1421, "278,287": 1422, "344,116": 1423, "297,543": 1424, "314,269": 1425, "316,284": 1426, "112,115": 1427, "276,103": 1428, "1164,269": 1429, "302,439": 1430, "1116,709": 1431, "1125,874": 1432, "335,365": 1433, "385,272": 1434, "116,401": 1435, "270,352": 1436, "121,108": 1437, "324,349": 1438, "320,1171": 1439, "416,480": 1440, "320,350": 1441, "296,366": 1442, "330,486": 1443, "105,403": 1444, "343,276": 1445, "295,276": 1446, "305,282": 1447, "662,276": 1448, "295,724": 1449, "1030,381": 1450, "443,718": 1451, "267,276": 1452, "280,345": 1453, "265,116": 1454, "378,117": 1455, "99,121": 1456, "965,451": 1457, "316,262": 1458, "665,1350": 1459, "307,298": 1460, "283,395": 1461, "278,508": 1462, "309,396": 1463, "277,467": 1464, "343,823": 1465, "302,565": 1466, "271,491": 1467, "469,103": 1468, "608,371": 1469, "105,275": 1470, "335,825": 1471, "321,549": 1472, "306,272": 1473, "259,987": 1474, "297,392": 1475, "343,287": 1476, "674,392": 1477, "369,108": 1478, "805,115": 1479, "296,319": 1480, "1093,519": 1481, "813,121": 1482, "111,120": 1483, "346,280": 1484, "109,112": 1485, "310,679": 1486, "369,1123": 1487, "1392,753": 1488, "289,282": 1489, "1487,550": 1490, "1490,484": 1491, "379,115": 1492, "355,411": 1493, "292,112": 1494, "663,1108": 1495, "856,422": 1496, "494,1242": 1497, "1086,457": 1498, "402,669": 1499, "408,782": 1500, "99,549": 1501, "328,267": 1502, "384,755": 1503, "115,104": 1504, "1015,703": 1505, "432,276": 1506, "367,101": 1507, "477,101": 1508, "273,513": 1509, "276,688": 1510, "435,105": 1511, "108,117": 1512, "270,539": 1513, "110,447": 1514, "912,575": 1515, "595,657": 1516, "325,282": 1517, "97,117": 1518, "423,98": 1519, "1488,101": 1520, "97,102": 1521, "314,406": 1522, "556,1444": 1523, "359,262": 1524, "287,107": 1525, "295,1450": 1526, "332,264": 1527, "295,621": 1528, "356,414": 1529, "821,1326": 1530, "369,1469": 1531, "438,558": 1532, "591,48": 1533, "773,670": 1534, "354,282": 1535, "314,431": 1536, "373,1022": 1537, "340,547": 1538, "267,119": 1539, "299,118": 1540, "306,109": 1541, "1000,371": 1542, "335,719": 1543, "97,576": 1544, "1092,463": 1545, "110,765": 1546, "277,330": 1547, "296,395": 1548, "268,691": 1549, "347,269": 1550, "1002,269": 1551, "408,1412": 1552, "425,115": 1553, "353,49": 1554, "277,713": 1555, "367,395": 1556, "307,269": 1557, "355,532": 1558, "108,485": 1559, "326,104": 1560, "32,88": 1561, "277,622": 1562, "286,278": 1563, "514,299": 1564, "753,492": 1565, "261,118": 1566, "259,402": 1567, "118,281": 1568, "1294,1040": 1569, "115,977": 1570, "277,454": 1571, "1065,441": 1572, "346,264": 1573, "814,115": 1574, "284,688": 1575, "536,633": 1576, "295,333": 1577, "518,1245": 1578, "111,265": 1579, "399,269": 1580, "487,298": 1581, "377,358": 1582, "355,392": 1583, "302,287": 1584, "942,278": 1585, "290,345": 1586, "297,875": 1587, "299,116": 1588, "324,262": 1589, "278,484": 1590, "104,319": 1591, "496,56": 1592, "324,284": 1593, "409,112": 1594, "276,462": 1595, "333,281": 1596, "496,57": 1597, "273,293": 1598, "110,97": 1599, "279,418": 1600, "292,642": 1601, "353,52": 1602, "270,644": 1603, "1329,275": 1604, "316,98": 1605, "479,300": 1606, "520,1302": 1607, "259,119": 1608, "268,107": 1609, "268,512": 1610, "1017,1047": 1611, "317,439": 1612, "285,892": 1613, "289,478": 1614, "397,282": 1615, "352,115": 1616, "896,287": 1617, "591,49": 1618, "273,275": 1619, "312,116": 1620, "494,282": 1621, "842,440": 1622, "306,341": 1623, "1141,1447": 1624, "550,609": 1625, "101,322": 1626, "99,827": 1627, "297,393": 1628, "114,629": 1629, "324,430": 1630, "384,111": 1631, "524,1321": 1632, "281,762": 1633, "316,276": 1634, "365,103": 1635, "32,38": 1636, "982,616": 1637, "267,332": 1638, "267,322": 1639, "432,281": 1640, "1337,307": 1641, "281,101": 1642, "115,512": 1643, "410,115": 1644, "296,312": 1645, "295,121": 1646, "361,326": 1647, "108,264": 1648, "360,104": 1649, "976,121": 1650, "112,282": 1651, "259,1170": 1652, "353,50": 1653, "279,1443": 1654, "260,108": 1655, "268,307": 1656, "281,99": 1657, "363,400": 1658, "344,115": 1659, "395,269": 1660, "330,115": 1661, "469,649": 1662, "264,121": 1663, "279,267": 1664, "397,108": 1665, "1225,694": 1666, "259,724": 1667, "314,693": 1668, "292,116": 1669, "496,55": 1670, "1340,264": 1671, "650,101": 1672, "103,121": 1673, "261,1244": 1674, "779,116": 1675, "282,109": 1676, "760,609": 1677, "297,1391": 1678, "293,281": 1679, "354,621": 1680, "313,111": 1681, "388,116": 1682, "313,451": 1683, "297,1196": 1684, "672,508": 1685, "306,497": 1686, "98,111": 1687, "982,1310": 1688, "109,101": 1689, "295,399": 1690, "514,322": 1691, "317,461": 1692, "845,269": 1693, "296,385": 1694, "264,288": 1695, "1233,121": 1696, "270,395": 1697, "359,545": 1698, "585,1022": 1699, "294,553": 1700, "114,342": 1701, "313,307": 1702, "97,105": 1703, "696,103": 1704, "590,101": 1705, "449,284": 1706, "618,264": 1707, "277,114": 1708, "313,287": 1709, "591,50": 1710, "262,288": 1711, "805,575": 1712, "277,275": 1713, "586,543": 1714, "517,114": 1715, "1142,603": 1716, "380,118": 1717, "1348,298": 1718, "357,115": 1719, "259,294": 1720, "102,482": 1721, "265,281": 1722, "32,312": 1723, "542,265": 1724, "277,461": 1725, "313,682": 1726, "1073,1512": 1727, "353,51": 1728, "577,101": 1729, "517,109": 1730, "376,1724": 1731, "121,299": 1732, "297,1027": 1733, "97,377": 1734, "268,610": 1735, "279,412": 1736, "341,99": 1737, "674,365": 1738, "437,112": 1739, "325,711": 1740, "524,516": 1741, "335,114": 1742, "294,121": 1743, "273,345": 1744, "460,1139": 1745, "1346,440": 1746, "902,334": 1747, "852,892": 1748, "387,48": 1749, "401,288": 1750, "367,351": 1751, "283,290": 1752, "355,273": 1753, "314,447": 1754, "347,281": 1755, "490,103": 1756, "439,101": 1757, "1200,490": 1758, "287,100": 1759, "267,311": 1760, "279,1064": 1761, "361,984": 1762, "443,970": 1763, "302,715": 1764, "964,121": 1765, "97,101": 1766, "103,281": 1767, "409,102": 1768, "1322,322": 1769, "99,1301": 1770, "261,506": 1771, "1138,116": 1772, "462,439": 1773, "259,366": 1774, "335,1445": 1775, "416,322": 1776, "378,818": 1777, "314,350": 1778, "727,322": 1779, "117,816": 1780, "297,342": 1781, "270,434": 1782, "305,299": 1783, "465,101": 1784, "651,1457": 1785, "335,493": 1786, "289,273": 1787, "280,99": 1788, "354,334": 1789, "97,506": 1790, "634,582": 1791, "663,357": 1792, "961,568": 1793, "442,683": 1794, "831,101": 1795, "275,422": 1796, "268,435": 1797, "1049,269": 1798, "939,419": 1799, "306,98": 1800, "408,775": 1801, "1669,287": 1802, "279,629": 1803, "346,420": 1804, "335,686": 1805, "114,358": 1806, "510,985": 1807, "279,548": 1808, "692,269": 1809, "1158,528": 1810, "270,307": 1811, "280,265": 1812, "407,98": 1813, "99,447": 1814, "115,112": 1815, "279,1499": 1816, "467,115": 1817, "397,120": 1818, "615,107": 1819, "946,116": 1820, "886,844": 1821, "97,365": 1822, "99,265": 1823, "760,640": 1824, "1540,823": 1825, "279,644": 1826, "352,288": 1827, "1263,269": 1828, "304,109": 1829, "1015,262": 1830, "496,54": 1831, "301,114": 1832, "121,110": 1833, "97,522": 1834, "314,478": 1835, "355,448": 1836, "674,265": 1837, "1409,951": 1838, "288,777": 1839, "314,480": 1840, "1257,809": 1841, "437,101": 1842, "443,100": 1843, "326,778": 1844, "544,109": 1845, "638,101": 1846, "395,115": 1847, "1686,1271": 1848, "869,103": 1849, "441,329": 1850, "459,101": 1851, "330,615": 1852, "32,264": 1853, "510,332": 1854, "349,269": 1855, "829,269": 1856, "519,102": 1857, "349,104": 1858, "1235,288": 1859, "289,637": 1860, "384,101": 1861, "663,269": 1862, "409,916": 1863, "340,688": 1864, "320,427": 1865, "353,55": 1866, "954,115": 1867, "450,500": 1868, "551,288": 1869, "317,480": 1870, "304,119": 1871, "560,48": 1872, "353,56": 1873, "336,307": 1874, "924,623": 1875, "262,447": 1876, "98,115": 1877, "1177,587": 1878, "1028,809": 1879, "32,512": 1880, "565,678": 1881, "328,462": 1882, "259,1087": 1883, "386,112": 1884, "295,1069": 1885, "259,276": 1886, "999,1770": 1887, "656,1570": 1888, "678,287": 1889, "591,51": 1890, "1674,275": 1891, "279,365": 1892, "279,929": 1893, "273,371": 1894, "1137,1590": 1895, "304,326": 1896, "1197,481": 1897, "388,336": 1898, "299,282": 1899, "1198,299": 1900, "394,458": 1901, "1685,736": 1902, "110,269": 1903, "268,278": 1904, "738,115": 1905, "314,336": 1906, "767,115": 1907, "268,1311": 1908, "302,322": 1909, "306,102": 1910, "354,419": 1911, "300,486": 1912, "283,349": 1913, "1106,293": 1914, "639,453": 1915, "278,390": 1916, "482,115": 1917, "332,104": 1918, "979,468": 1919, "268,119": 1920, "269,264": 1921, "1777,287": 1922, "297,350": 1923, "335,108": 1924, "554,48": 1925, "334,108": 1926, "287,372": 1927, "278,453": 1928, "290,281": 1929, "268,334": 1930, "439,322": 1931, "353,54": 1932, "459,431": 1933, "313,275": 1934, "1912,110": 1935, "394,825": 1936, "277,1060": 1937, "319,98": 1938, "570,57": 1939, "99,264": 1940, "304,121": 1941, "335,723": 1942, "1548,1743": 1943, "321,121": 1944, "279,116": 1945, "355,282": 1946, "725,889": 1947, "290,762": 1948, "355,101": 1949, "910,803": 1950, "722,1061": 1951, "97,312": 1952, "320,755": 1953, "335,332": 1954, "402,281": 1955, "119,534": 1956, "1358,115": 1957, "460,506": 1958, "905,307": 1959, "335,276": 1960, "325,111": 1961, "402,101": 1962, "296,671": 1963, "734,293": 1964, "259,264": 1965, "822,112": 1966, "378,108": 1967, "979,269": 1968, "1388,299": 1969, "100,316": 1970, "268,393": 1971, "442,426": 1972, "107,115": 1973, "393,307": 1974, "102,293": 1975, "1387,1834": 1976, "267,319": 1977, "1852,991": 1978, "340,364": 1979, "798,1349": 1980, "1406,608": 1981, "279,321": 1982, "535,1700": 1983, "616,115": 1984, "276,1456": 1985, "289,385": 1986, "97,330": 1987, "292,330": 1988, "1223,344": 1989, "278,571": 1990, "406,269": 1991, "268,265": 1992, "1057,882": 1993, "302,100": 1994, "883,1060": 1995, "261,710": 1996, "637,298": 1997, "390,110": 1998, "794,606": 1999, "1046,115": 2000, "1142,275": 2001, "363,1465": 2002, "279,1025": 2003, "1121,474": 2004, "111,299": 2005, "800,97": 2006, "279,400": 2007, "299,463": 2008, "279,1620": 2009, "304,336": 2010, "475,269": 2011, "287,116": 2012, "320,480": 2013, "304,415": 2014, "1758,640": 2015, "109,478": 2016, "302,1472": 2017, "361,1212": 2018, "676,110": 2019, "324,265": 2020, "410,101": 2021, "361,681": 2022, "975,448": 2023, "1726,121": 2024, "471,290": 2025, "99,316": 2026, "628,1825": 2027, "277,490": 2028, "260,109": 2029, "820,103": 2030, "496,53": 2031, "361,1410": 2032, "1401,1642": 2033, "355,358": 2034, "324,322": 2035, "105,424": 2036, "637,269": 2037, "1147,997": 2038, "118,307": 2039, "514,816": 2040, "336,1253": 2041, "408,287": 2042, "280,288": 2043, "283,282": 2044, "1248,709": 2045, "459,1638": 2046, "1585,492": 2047, "428,276": 2048, "835,269": 2049, "261,357": 2050, "102,1025": 2051, "278,288": 2052, "292,111": 2053, "353,57": 2054, "284,97": 2055, "416,880": 2056, "397,461": 2057, "361,950": 2058, "924,269": 2059, "99,461": 2060, "277,633": 2061, "577,358": 2062, "267,103": 2063, "304,264": 2064, "601,726": 2065, "591,52": 2066, "332,116": 2067, "618,381": 2068, "378,114": 2069, "279,1675": 2070, "354,264": 2071, "302,118": 2072, "287,451": 2073, "1604,463": 2074, "380,100": 2075, "746,336": 2076, "279,1111": 2077, "728,108": 2078, "904,458": 2079, "262,358": 2080, "476,288": 2081, "360,1273": 2082, "279,299": 2083, "553,383": 2084, "301,111": 2085, "289,347": 2086, "277,1737": 2087, "749,108": 2088, "334,1102": 2089, "441,275": 2090, "397,109": 2091, "346,276": 2092, "277,478": 2093, "333,579": 2094, "428,101": 2095, "409,1814": 2096, "320,265": 2097, "296,343": 2098, "355,1732": 2099, "121,288": 2100, "314,789": 2101, "408,334": 2102, "1297,305": 2103, "428,972": 2104, "261,436": 2105, "1408,269": 2106, "277,121": 2107, "1325,112": 2108, "615,116": 2109, "469,116": 2110, "108,844": 2111, "565,352": 2112, "787,545": 2113, "325,411": 2114, "259,1506": 2115, "330,103": 2116, "259,1565": 2117, "541,299": 2118, "279,480": 2119, "1104,622": 2120, "589,267": 2121, "326,347": 2122, "960,401": 2123, "1407,1266": 2124, "270,333": 2125, "279,366": 2126, "586,316": 2127, "261,463": 2128, "1993,434": 2129, "304,371": 2130, "297,278": 2131, "792,332": 2132, "32,867": 2133, "561,316": 2134, "710,115": 2135, "341,108": 2136, "259,1844": 2137, "856,474": 2138, "105,349": 2139, "277,410": 2140, "111,587": 2141, "852,288": 2142, "324,275": 2143, "355,1195": 2144, "1658,333": 2145, "354,426": 2146, "1183,116": 2147, "1572,2111": 2148, "104,288": 2149, "306,383": 2150, "1008,322": 2151, "276,640": 2152, "295,109": 2153, "1705,992": 2154, "894,281": 2155, "780,108": 2156, "99,305": 2157, "876,548": 2158, "681,669": 2159, "400,287": 2160, "1197,473": 2161, "32,33": 2162, "324,269": 2163, "479,1756": 2164, "913,461": 2165, "1138,581": 2166, "1137,281": 2167, "283,1420": 2168, "261,652": 2169, "108,447": 2170, "978,294": 2171, "361,430": 2172, "514,1007": 2173, "403,281": 2174, "295,607": 2175, "117,107": 2176, "290,107": 2177, "592,116": 2178, "410,104": 2179, "103,723": 2180, "402,487": 2181, "270,1634": 2182, "781,343": 2183, "416,1135": 2184, "343,305": 2185, "635,300": 2186, "105,326": 2187, "1555,269": 2188, "105,381": 2189, "1182,269": 2190, "728,1072": 2191, "1305,109": 2192, "311,264": 2193, "1070,957": 2194, "520,110": 2195, "801,269": 2196, "100,352": 2197, "1910,615": 2198, "1109,287": 2199, "289,401": 2200, "341,265": 2201, "1364,1034": 2202, "273,673": 2203, "262,116": 2204, "393,98": 2205, "109,276": 2206, "1823,316": 2207, "354,101": 2208, "260,267": 2209, "361,1889": 2210, "416,617": 2211, "517,371": 2212, "408,344": 2213, "278,282": 2214, "834,119": 2215, "626,399": 2216, "704,332": 2217, "491,269": 2218, "899,265": 2219, "1187,117": 2220, "292,1256": 2221, "2221,390": 2222, "912,269": 2223, "346,406": 2224, "259,267": 2225, "346,1027": 2226, "297,691": 2227, "277,347": 2228, "424,116": 2229, "343,333": 2230, "570,56": 2231, "100,276": 2232, "368,653": 2233, "327,364": 2234, "320,472": 2235, "330,98": 2236, "672,299": 2237, "839,269": 2238, "517,103": 2239, "896,448": 2240, "355,402": 2241, "578,107": 2242, "380,110": 2243, "111,506": 2244, "1129,1053": 2245, "1071,458": 2246, "596,99": 2247, "1026,1626": 2248, "354,427": 2249, "260,322": 2250, "100,299": 2251, "677,116": 2252, "321,281": 2253, "514,470": 2254, "32,1657": 2255, "489,49": 2256, "283,433": 2257, "366,121": 2258, "282,97": 2259, "295,747": 2260, "421,762": 2261, "1791,434": 2262, "289,402": 2263, "99,288": 2264, "975,119": 2265, "268,693": 2266, "261,609": 2267, "1054,571": 2268, "302,553": 2269, "620,287": 2270, "618,288": 2271, "457,115": 2272, "273,97": 2273, "1023,473": 2274, "333,115": 2275, "99,111": 2276, "101,101": 2277, "646,121": 2278, "114,448": 2279, "405,486": 2280, "99,307": 2281, "319,307": 2282, "476,115": 2283, "496,52": 2284, "295,539": 2285, "1114,112": 2286, "324,121": 2287, "283,670": 2288, "1028,1582": 2289, "295,344": 2290, "1630,1952": 2291, "881,118": 2292, "408,435": 2293, "348,107": 2294, "416,929": 2295, "1194,330": 2296, "1134,269": 2297, "355,552": 2298, "1649,644": 2299, "630,115": 2300, "570,54": 2301, "302,110": 2302, "279,433": 2303, "114,352": 2304, "1433,115": 2305, "290,288": 2306, "364,269": 2307, "1008,486": 2308, "525,403": 2309, "366,708": 2310, "522,269": 2311, "407,468": 2312, "314,932": 2313, "311,278": 2314, "108,262": 2315, "283,772": 2316, "279,413": 2317, "591,53": 2318, "268,653": 2319, "314,453": 2320, "689,115": 2321, "314,1254": 2322, "1179,364": 2323, "283,1605": 2324, "689,269": 2325, "1975,633": 2326, "356,1355": 2327, "295,714": 2328, "289,464": 2329, "304,1059": 2330, "385,112": 2331, "1289,105": 2332, "807,1773": 2333, "314,458": 2334, "584,121": 2335, "275,288": 2336, "409,2192": 2337, "299,609": 2338, "1024,2326": 2339, "524,679": 2340, "367,1009": 2341, "1192,1625": 2342, "763,350": 2343, "384,275": 2344, "406,293": 2345, "1999,736": 2346, "304,543": 2347, "272,264": 2348, "297,478": 2349, "1278,115": 2350, "304,284": 2351, "293,97": 2352, "1830,566": 2353, "262,111": 2354, "428,1651": 2355, "810,1511": 2356, "614,265": 2357, "746,629": 2358, "282,371": 2359, "302,98": 2360, "2092,528": 2361, "923,288": 2362, "590,657": 2363, "793,316": 2364, "408,411": 2365, "373,2016": 2366, "2058,116": 2367, "295,264": 2368, "306,299": 2369, "427,115": 2370, "828,432": 2371, "286,106": 2372, "1480,552": 2373, "365,107": 2374, "564,1267": 2375, "833,372": 2376, "386,575": 2377, "108,293": 2378, "437,115": 2379, "286,684": 2380, "325,312": 2381, "496,48": 2382, "302,697": 2383, "1068,1072": 2384, "325,395": 2385, "109,288": 2386, "277,670": 2387, "459,282": 2388, "501,341": 2389, "973,287": 2390, "524,386": 2391, "1740,299": 2392, "1687,425": 2393, "361,269": 2394, "1438,293": 2395, "1403,485": 2396, "277,719": 2397, "295,105": 2398, "423,118": 2399, "883,1132": 2400, "564,1201": 2401, "902,395": 2402, "1187,527": 2403, "117,299": 2404, "476,350": 2405, "363,1299": 2406, "1628,284": 2407, "683,117": 2408, "976,492": 2409, "283,2252": 2410, "560,396": 2411, "279,578": 2412, "872,2230": 2413, "570,55": 2414, "319,97": 2415, "354,1734": 2416, "377,97": 2417, "1070,1097": 2418, "295,907": 2419, "1911,867": 2420, "361,300": 2421, "465,288": 2422, "469,461": 2423, "689,288": 2424, "1327,269": 2425, "314,1822": 2426, "400,281": 2427, "536,377": 2428, "313,437": 2429, "324,305": 2430, "2050,552": 2431, "292,1163": 2432, "1782,269": 2433, "295,633": 2434, "306,103": 2435, "815,298": 2436, "346,334": 2437, "872,483": 2438, "1779,575": 2439, "1913,1876": 2440, "2341,1839": 2441, "107,121": 2442, "333,288": 2443, "974,485": 2444, "277,101": 2445, "105,334": 2446, "408,101": 2447, "785,706": 2448, "1720,1644": 2449, "449,1168": 2450, "317,1916": 2451, "1091,457": 2452, "118,288": 2453, "612,587": 2454, "1106,854": 2455, "1566,692": 2456, "297,265": 2457, "434,293": 2458, "302,611": 2459, "1768,447": 2460, "438,2237": 2461, "1074,115": 2462, "2285,474": 2463, "103,111": 2464, "122,101": 2465, "317,2207": 2466, "569,2195": 2467, "279,282": 2468, "276,269": 2469, "270,898": 2470, "446,371": 2471, "663,103": 2472, "371,519": 2473, "1704,312": 2474, "1065,336": 2475, "307,474": 2476, "517,1061": 2477, "279,435": 2478, "114,480": 2479, "2406,653": 2480, "428,120": 2481, "496,51": 2482, "116,111": 2483, "676,395": 2484, "369,751": 2485, "313,467": 2486, "268,467": 2487, "1428,372": 2488, "1109,566": 2489, "295,530": 2490, "296,300": 2491, "1516,269": 2492, "796,305": 2493, "346,319": 2494, "276,281": 2495, "1931,779": 2496, "409,558": 2497, "411,115": 2498, "117,506": 2499, "1547,1400": 2500, "111,102": 2501, "98,101": 2502, "467,110": 2503, "1799,307": 2504, "313,415": 2505, "662,708": 2506, "1481,726": 2507, "378,454": 2508, "278,371": 2509, "1257,452": 2510, "489,53": 2511, "279,342": 2512, "346,433": 2513, "2485,288": 2514, "444,101": 2515, "118,1783": 2516, "97,347": 2517, "369,503": 2518, "267,121": 2519, "32,122": 2520, "324,484": 2521, "1801,603": 2522, "1466,1168": 2523, "376,300": 2524, "378,719": 2525, "363,114": 2526, "426,468": 2527, "324,287": 2528, "1055,269": 2529, "295,636": 2530, "775,298": 2531, "335,1224": 2532, "394,101": 2533, "416,377": 2534, "278,507": 2535, "791,265": 2536, "320,1458": 2537, "378,294": 2538, "379,616": 2539, "324,332": 2540, "279,470": 2541, "376,97": 2542, "120,293": 2543, "264,505": 2544, "111,275": 2545, "297,1817": 2546, "261,347": 2547, "1520,284": 2548, "301,525": 2549, "993,1881": 2550, "905,867": 2551, "514,316": 2552, "882,358": 2553, "115,99": 2554, "1747,726": 2555, "287,269": 2556, "361,1426": 2557, "117,312": 2558, "881,102": 2559, "437,264": 2560, "1098,844": 2561, "547,99": 2562, "355,550": 2563, "97,608": 2564, "324,426": 2565, "290,298": 2566, "494,1902": 2567, "385,262": 2568, "262,406": 2569, "102,433": 2570, "119,395": 2571, "262,110": 2572, "1186,352": 2573, "1389,432": 2574, "282,110": 2575, "297,275": 2576, "413,102": 2577, "268,1827": 2578, "366,275": 2579, "363,284": 2580, "325,264": 2581, "363,265": 2582, "1464,116": 2583, "450,344": 2584, "310,719": 2585, "564,412": 2586, "1134,288": 2587, "815,809": 2588, "324,321": 2589, "66,67": 2590, "619,112": 2591, "1110,275": 2592, "299,103": 2593, "314,2488": 2594, "322,281": 2595, "872,293": 2596, "436,101": 2597, "501,287": 2598, "941,1423": 2599, "380,2084": 2600, "1849,395": 2601, "518,720": 2602, "848,649": 2603, "297,316": 2604, "110,350": 2605, "1479,1155": 2606, "2122,453": 2607, "32,411": 2608, "968,1755": 2609, "885,710": 2610, "2421,507": 2611, "268,1935": 2612, "296,294": 2613, "504,288": 2614, "313,294": 2615, "297,121": 2616, "399,111": 2617, "293,299": 2618, "1781,1319": 2619, "369,391": 2620, "725,472": 2621, "2088,933": 2622, "496,49": 2623, "259,395": 2624, "300,108": 2625, "1563,1100": 2626, "392,264": 2627, "304,288": 2628, "314,121": 2629, "2456,668": 2630, "1841,329": 2631, "556,2281": 2632, "367,305": 2633, "434,528": 2634, "297,425": 2635, "989,269": 2636, "2022,1964": 2637, "428,439": 2638, "848,1711": 2639, "340,640": 2640, "295,483": 2641, "438,406": 2642, "112,329": 2643, "324,333": 2644, "452,112": 2645, "324,399": 2646, "104,631": 2647, "290,121": 2648, "1276,1970": 2649, "1621,661": 2650, "384,1355": 2651, "1607,121": 2652, "105,386": 2653, "289,621": 2654, "864,108": 2655, "431,103": 2656, "99,390": 2657, "114,321": 2658, "1091,680": 2659, "361,281": 2660, "797,269": 2661, "354,287": 2662, "785,282": 2663, "1307,67": 2664, "405,506": 2665, "1323,269": 2666, "270,433": 2667, "2134,290": 2668, "438,99": 2669, "1797,474": 2670, "402,284": 2671, "2261,755": 2672, "347,513": 2673, "325,347": 2674, "1005,847": 2675, "98,275": 2676, "366,115": 2677, "385,103": 2678, "413,772": 2679, "363,681": 2680, "442,1135": 2681, "961,653": 2682, "314,2408": 2683, "754,264": 2684, "289,2187": 2685, "2389,1273": 2686, "1986,986": 2687, "1095,269": 2688, "746,343": 2689, "283,411": 2690, "273,1317": 2691, "1356,666": 2692, "1046,916": 2693, "267,109": 2694, "114,415": 2695, "1418,642": 2696, "304,276": 2697, "1184,1126": 2698, "297,1978": 2699, "815,425": 2700, "1865,1998": 2701, "260,461": 2702, "496,50": 2703, "105,358": 2704, "1784,681": 2705, "1101,1162": 2706, "278,275": 2707, "761,806": 2708, "480,115": 2709, "494,1291": 2710, "107,105": 2711, "324,264": 2712, "2235,312": 2713, "1769,97": 2714, "794,342": 2715, "1508,269": 2716, "304,108": 2717, "1215,623": 2718, "1709,2679": 2719, "495,956": 2720, "289,461": 2721, "381,736": 2722, "361,804": 2723, "599,121": 2724, "355,410": 2725, "442,1291": 2726, "105,1757": 2727, "669,269": 2728, "277,300": 2729, "634,2332": 2730, "325,352": 2731, "117,345": 2732, "118,287": 2733, "861,109": 2734, "304,319": 2735, "311,265": 2736, "435,114": 2737, "1829,351": 2738, "597,112": 2739, "792,290": 2740, "115,312": 2741, "1843,694": 2742, "1544,345": 2743, "324,111": 2744, "259,719": 2745, "715,579": 2746, "259,1069": 2747, "2172,425": 2748, "528,288": 2749, "2535,101": 2750, "2369,120": 2751, "872,2159": 2752, "314,1203": 2753, "1057,269": 2754, "845,101": 2755, "305,981": 2756, "2719,481": 2757, "432,264": 2758, "261,2473": 2759, "332,1956": 2760, "701,345": 2761, "651,298": 2762, "393,112": 2763, "289,381": 2764, "378,403": 2765, "278,122": 2766, "261,112": 2767, "378,969": 2768, "393,101": 2769, "326,447": 2770, "282,874": 2771, "286,110": 2772, "1603,115": 2773, "1166,616": 2774, "407,2562": 2775, "596,592": 2776, "270,273": 2777, "805,1928": 2778, "446,115": 2779, "2486,116": 2780, "793,1271": 2781, "297,505": 2782, "477,307": 2783, "110,312": 2784, "289,344": 2785, "476,269": 2786, "973,288": 2787, "541,1203": 2788, "501,775": 2789, "268,557": 2790, "313,440": 2791, "880,115": 2792, "624,1643": 2793, "325,385": 2794, "118,284": 2795, "705,115": 2796, "437,116": 2797, "455,112": 2798, "704,312": 2799, "292,414": 2800, "301,316": 2801, "1761,1382": 2802, "306,652": 2803, "439,675": 2804, "277,1899": 2805, "1431,329": 2806, "117,358": 2807, "785,395": 2808, "355,658": 2809, "829,288": 2810, "1905,1511": 2811, "306,99": 2812, "743,48": 2813, "792,284": 2814, "424,103": 2815, "392,288": 2816, "659,48": 2817, "260,116": 2818, "333,97": 2819, "320,485": 2820, "349,298": 2821, "807,916": 2822, "722,116": 2823, "273,262": 2824, "279,1809": 2825, "350,115": 2826, "289,330": 2827, "810,406": 2828, "407,101": 2829, "1966,985": 2830, "1430,958": 2831, "386,288": 2832, "554,53": 2833, "1519,347": 2834, "608,103": 2835, "1209,1105": 2836, "409,98": 2837, "102,275": 2838, "317,121": 2839, "459,436": 2840, "277,550": 2841, "287,298": 2842, "1023,481": 2843, "314,953": 2844, "1119,121": 2845, "324,621": 2846, "1419,115": 2847, "109,97": 2848, "269,121": 2849, "676,1043": 2850, "1101,344": 2851, "584,115": 2852, "354,1527": 2853, "533,101": 2854, "320,282": 2855, "378,691": 2856, "268,305": 2857, "529,977": 2858, "1497,473": 2859, "310,1156": 2860, "546,371": 2861, "115,736": 2862, "1110,269": 2863, "354,273": 2864, "280,108": 2865, "110,281": 2866, "541,115": 2867, "32,1299": 2868, "279,557": 2869, "631,1228": 2870, "2591,653": 2871, "319,264": 2872, "277,464": 2873, "518,1629": 2874, "570,53": 2875, "561,273": 2876, "384,89": 2877, "32,63": 2878, "301,1087": 2879, "299,98": 2880, "264,726": 2881, "1084,2008": 2882, "793,447": 2883, "1639,121": 2884, "796,262": 2885, "313,461": 2886, "2082,878": 2887, "111,333": 2888, "1120,115": 2889, "408,2446": 2890, "265,1599": 2891, "346,411": 2892, "268,1287": 2893, "455,75": 2894, "304,472": 2895, "441,1228": 2896, "1319,264": 2897, "368,679": 2898, "290,680": 2899, "363,366": 2900, "1632,269": 2901, "367,1633": 2902, "2019,755": 2903, "2294,269": 2904, "314,931": 2905, "283,105": 2906, "1066,715": 2907, "355,2835": 2908, "564,1452": 2909, "277,260": 2910, "335,453": 2911, "1258,2543": 2912, "937,115": 2913, "2895,964": 2914, "265,462": 2915, "1962,102": 2916, "495,99": 2917, "360,103": 2918, "109,282": 2919, "1179,107": 2920, "465,765": 2921, "1515,287": 2922, "369,664": 2923, "325,276": 2924, "279,2673": 2925, "378,1434": 2926, "304,435": 2927, "469,1349": 2928, "368,316": 2929, "849,284": 2930, "335,691": 2931, "1328,275": 2932, "363,111": 2933, "306,1163": 2934, "271,112": 2935, "278,281": 2936, "340,116": 2937, "329,288": 2938, "1983,640": 2939, "265,311": 2940, "296,265": 2941, "662,2094": 2942, "647,109": 2943, "428,97": 2944, "1682,105": 2945, "1880,97": 2946, "101,120": 2947, "2448,329": 2948, "277,287": 2949, "273,603": 2950, "373,2884": 2951, "489,50": 2952, "325,114": 2953, "761,264": 2954, "276,97": 2955, "283,1545": 2956, "1664,439": 2957, "1167,364": 2958, "349,112": 2959, "324,478": 2960, "1209,609": 2961, "760,383": 2962, "365,116": 2963, "98,458": 2964, "1194,415": 2965, "289,305": 2966, "313,490": 2967, "438,1132": 2968, "326,107": 2969, "341,372": 2970, "1032,48": 2971, "101,393": 2972, "423,287": 2973, "289,276": 2974, "326,1100": 2975, "551,1034": 2976, "850,492": 2977, "947,48": 2978, "993,98": 2979, "270,1633": 2980, "1715,826": 2981, "282,288": 2982, "904,804": 2983, "361,750": 2984, "1776,847": 2985, "921,401": 2986, "277,2185": 2987, "108,1040": 2988, "2107,1332": 2989, "264,1673": 2990, "377,329": 2991, "405,357": 2992, "101,287": 2993, "290,99": 2994, "346,344": 2995, "2126,930": 2996, "1908,1087": 2997, "363,352": 2998, "1005,121": 2999, "279,686": 3000, "337,109": 3001, "1091,2915": 3002, "728,823": 3003, "354,321": 3004, "295,2278": 3005, "32,45": 3006, "1690,2444": 3007, "2789,275": 3008, "2868,2975": 3009, "596,118": 3010, "1492,527": 3011, "376,539": 3012, "2988,307": 3013, "314,441": 3014, "301,385": 3015, "2559,617": 3016, "1407,264": 3017, "114,458": 3018, "802,686": 3019, "325,330": 3020, "295,480": 3021, "494,293": 3022, "401,116": 3023, "1157,2214": 3024, "1012,1309": 3025, "906,115": 3026, "278,264": 3027, "1738,451": 3028, "1192,1195": 3029, "2475,448": 3030, "517,546": 3031, "725,401": 3032, "282,422": 3033, "324,411": 3034, "743,57": 3035, "725,1750": 3036, "317,1948": 3037, "968,275": 3038, "1306,987": 3039, "1795,448": 3040, "361,104": 3041, "262,307": 3042, "447,298": 3043, "2686,481": 3044, "1615,329": 3045, "1360,120": 3046, "342,284": 3047, "377,102": 3048, "869,1124": 3049, "385,98": 3050, "385,119": 3051, "2127,288": 3052, "796,112": 3053, "270,686": 3054, "1054,507": 3055, "324,682": 3056, "489,54": 3057, "114,275": 3058, "942,587": 3059, "307,104": 3060, "1745,1660": 3061, "1303,484": 3062, "1296,481": 3063, "1860,513": 3064, "876,694": 3065, "376,386": 3066, "450,1064": 3067, "716,48": 3068, "863,115": 3069, "103,276": 3070, "615,115": 3071, "394,483": 3072, "2775,474": 3073, "388,287": 3074, "280,281": 3075, "296,435": 3076, "392,115": 3077, "421,102": 3078, "314,1744": 3079, "314,111": 3080, "78,65": 3081, "1528,332": 3082, "264,697": 3083, "369,299": 3084, "1225,264": 3085, "1005,708": 3086, "881,723": 3087, "2402,342": 3088, "283,2916": 3089, "1038,1053": 3090, "1381,287": 3091, "1896,542": 3092, "262,383": 3093, "283,330": 3094, "337,102": 3095, "1416,120": 3096, "277,2123": 3097, "746,1812": 3098, "883,439": 3099, "1104,1212": 3100, "1288,452": 3101, "1054,116": 3102, "1901,830": 3103, "1498,115": 3104, "104,97": 3105, "297,410": 3106, "2363,571": 3107, "433,269": 3108, "296,264": 3109, "1971,547": 3110, "888,2174": 3111, "952,116": 3112, "2263,275": 3113, "1921,287": 3114, "105,419": 3115, "268,273": 3116, "1478,275": 3117, "259,282": 3118, "371,1135": 3119, "280,264": 3120, "317,547": 3121, "355,1790": 3122, "329,1485": 3123, "268,1729": 3124, "423,103": 3125, "2524,280": 3126, "412,115": 3127, "1794,281": 3128, "377,448": 3129, "674,1282": 3130, "336,431": 3131, "115,121": 3132, "1189,878": 3133, "1906,667": 3134, "564,2495": 3135, "405,3123": 3136, "416,984": 3137, "2083,332": 3138, "469,1196": 3139, "1943,269": 3140, "296,276": 3141, "316,109": 3142, "1694,119": 3143, "289,352": 3144, "104,284": 3145, "1020,516": 3146, "416,333": 3147, "73,73": 3148, "2930,504": 3149, "690,53": 3150, "268,977": 3151, "115,117": 3152, "108,111": 3153, "1440,115": 3154, "2503,287": 3155, "1068,512": 3156, "852,264": 3157, "1701,627": 3158, "942,293": 3159, "1652,101": 3160, "333,708": 3161, "639,298": 3162, "279,692": 3163, "296,431": 3164, "259,720": 3165, "1965,488": 3166, "316,115": 3167, "335,2136": 3168, "1594,1107": 3169, "1727,579": 3170, "116,422": 3171, "378,1452": 3172, "2146,121": 3173, "600,433": 3174, "259,1117": 3175, "570,52": 3176, "465,305": 3177, "1066,582": 3178, "1035,48": 3179, "2144,513": 3180, "361,111": 3181, "301,264": 3182, "518,294": 3183, "1612,452": 3184, "283,114": 3185, "341,287": 3186, "115,276": 3187, "489,396": 3188, "296,1465": 3189, "564,2181": 3190, "103,97": 3191, "116,116": 3192, "931,101": 3193, "405,558": 3194, "2811,358": 3195, "282,105": 3196, "354,402": 3197, "2121,269": 3198, "595,436": 3199, "286,1551": 3200, "283,350": 3201, "1314,652": 3202, "413,116": 3203, "1074,878": 3204, "669,288": 3205, "293,661": 3206, "363,117": 3207, "3022,2617": 3208, "296,2743": 3209, "283,342": 3210, "2151,2060": 3211, "289,1291": 3212, "1081,329": 3213, "1202,269": 3214, "324,985": 3215, "273,1221": 3216, "65,70": 3217, "1133,109": 3218, "423,681": 3219, "536,2471": 3220, "296,105": 3221, "394,679": 3222, "270,512": 3223, "336,393": 3224, "1572,1310": 3225, "1325,1274": 3226, "1275,1309": 3227, "743,56": 3228, "845,955": 3229, "494,3193": 3230, "2169,269": 